cheyann3k/AutoBadger/PSoC6-Code/drivers/ble.c
/******************************************************************************
* File Name: ble_findme.c
*
* Description: This file contains BLE related functions.
*
* Related Document: README.md
*
*******************************************************************************
* Copyright 2019-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/


/******************************************************************************
 * Include header files
 *****************************************************************************/
#include "ble.h"
#include "cyhal.h"
#include "cy_retarget_io.h"
#include "cybsp.h"
#include "../GeneratedSource/cycfg_ble.h"
#include "leds.h"
#include "usr_btn.h"

/*******************************************************************************
* Macros
********************************************************************************/
#define BLESS_INTR_PRIORITY       (1u)
#define WAKEUP_INTR_PRIORITY      (7u)
#define WAKEUP_TIMER_DELAY_MS     (250)
/* Timer value to get 0.25 sec with wakeup timer input clock of 32768 Hz,
 * where 32768Hz is LFCLK in PSoC 6 MCU */
#define WAKEUP_TIMER_MATCH_VALUE  (WAKEUP_TIMER_DELAY_MS * 32768 / 1000)


/*******************************************************************************
* Global Variables
********************************************************************************/
cyhal_lptimer_t wakeup_timer;
bool wakeup_intr_flag = false;
bool gpio_intr_flag = false;
uint8 alert_level = CY_BLE_NO_ALERT;
cy_stc_ble_conn_handle_t app_conn_handle;
cy_stc_ble_gatt_write_param_t *write_req_param;
cy_stc_ble_gatts_char_val_read_req_t *read_req_param;
uint8_t BTN_COUNT = 0;
bool uart_notif_en = false;

volatile bool ALERT_BLE_RX = false;
char bleInputString[ DEBUG_MESSAGE_MAX_LEN ];
int8_t bleInputIndex = 0;


/*******************************************************************************
* Function Prototypes
********************************************************************************/
static void ble_init(void);
static void bless_interrupt_handler(void);
static void stack_event_handler(uint32 event, void* eventParam);
static void ble_start_advertisement(void);
static void wakeup_timer_init(void);
static void wakeup_timer_interrupt_handler(void *handler_arg, cyhal_lptimer_event_t event);
static void ble_ias_callback(uint32 event, void *eventParam);
static void enter_low_power_mode(void);


/*******************************************************************************
* Function Name: ble_cli_init
********************************************************************************
* Summary:
* This function initializes the BLE and a deep sleep wakeup timer.
*
*******************************************************************************/
void ble_cli_init(void)
{
    /* Configure BLE */
    ble_init();

    /* Configure deep sleep wakeup timer */
    wakeup_timer_init();

    /* Enable global interrupts */
    __enable_irq();
}


/*******************************************************************************
* Function Name: ble_cli_process
********************************************************************************
* Summary:
*  This function processes the BLE events and configures the device to enter
*  low power mode as required.
*
*******************************************************************************/
void ble_cli_process(void)
{
    /* Enter low power mode. The call to enter_low_power_mode also causes the
     * device to enter hibernate mode if the BLE stack is shutdown.
     */
    enter_low_power_mode();

    /* Cy_BLE_ProcessEvents() allows the BLE stack to process pending events */
    Cy_BLE_ProcessEvents();

    if(wakeup_intr_flag)
    {
        wakeup_intr_flag = false;

        /* Update ECE453_USR_LED to indicate current BLE status */
        if(CY_BLE_ADV_STATE_ADVERTISING == Cy_BLE_GetAdvertisementState())
        {
            cyhal_gpio_toggle((cyhal_gpio_t)PIN_USER_LED);
        }
        else if(CY_BLE_CONN_STATE_CONNECTED == Cy_BLE_GetConnectionState(app_conn_handle))
        {
            cyhal_gpio_write((cyhal_gpio_t)PIN_USER_LED, CYBSP_LED_STATE_ON);
        }
        else
        {
            cyhal_gpio_write((cyhal_gpio_t)PIN_USER_LED, CYBSP_LED_STATE_OFF);
        }

        /* Update CYBSP_USER_LED2 to indicate current alert level */
        switch(alert_level)
        {
            case CY_BLE_NO_ALERT:
            {
                //cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED2, CYBSP_LED_STATE_OFF);
                break;
            }
            case CY_BLE_MILD_ALERT:
            {
                //cyhal_gpio_toggle((cyhal_gpio_t)CYBSP_USER_LED2);
                break;
            }
            case CY_BLE_HIGH_ALERT:
            {
                //cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED2, CYBSP_LED_STATE_ON);
                break;
            }
            default:
            {
                break;
            }
        }
    }
}


