cheyann3k/AutoBadger/PSoC6-Code/drivers/ble.c
        /* This event is generated at the GAP Peripheral end after disconnection */
        case CY_BLE_EVT_GATT_DISCONNECT_IND:
        {
            printf("[INFO] : GATT device disconnected\r\n");
            break;
        }

        /* This event indicates that the 'GATT MTU Exchange Request' is received */
        case CY_BLE_EVT_GATTS_XCNHG_MTU_REQ:
        {
            printf("[INFO] : GATT MTU Exchange Request received \r\n");
            break;
        }

        /* This event received when GATT read characteristic request received */
        case CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ:
        {
            printf("[INFO] : GATT read characteristic request received \r\n");
            read_req_param = (cy_stc_ble_gatts_char_val_read_req_t *)eventParam;

            if (CY_BLE_BUTTONS_USR_BTN_CHAR_HANDLE == read_req_param->attrHandle)
            {
            	printf("[INFO] : trying to read from USR_BTN characteristic\r\n");

            	CY_BLE_GATT_DB_ATTR_SET_GEN_VALUE(CY_BLE_BUTTONS_USR_BTN_CHAR_HANDLE,&BTN_COUNT,1);

                printf("[INFO] : BTN_COUNT %d\r\n", BTN_COUNT);
            }

            break;
        }
        case CY_BLE_EVT_GATTS_WRITE_CMD_REQ:
        		{

        			write_req_param = (cy_stc_ble_gatt_write_param_t*)eventParam;

                    printf("[INFO] : GATT write characteristic with handle: 0x%x\r\n", write_req_param->handleValPair.attrHandle);

                    switch (write_req_param->handleValPair.attrHandle) {
                        case CY_BLE_LEDS_USR_LED_CHAR_HANDLE: {
                            printf("[INFO] : GATT write USR_LED characteristic with value: 0x%x\r\n", write_req_param->handleValPair.value.val[0]);
                            break;
                        }
                        case CY_BLE_UART_RXD_CHAR_HANDLE: {
                            for (int i = 0; i < write_req_param->handleValPair.value.len; i++) {
                                if (write_req_param->handleValPair.value.val[i] == '\r' || 
                                    write_req_param->handleValPair.value.val[i] == '\n') {
                                    ALERT_BLE_RX = true;
                                    printf("[INFO] : GATT write UART RX with value: %s\r\n", 
                                        bleInputString);
                                    break;
                                }

                                bleInputString[bleInputIndex] = write_req_param->handleValPair.value.val[i];
                                bleInputIndex++;
                            }

                            cy_stc_ble_gatt_handle_value_pair_t uart_tx_handle = {
                                .attrHandle = CY_BLE_UART_TXD_CHAR_HANDLE,
                                .value.val = (uint8_t *)"Recieved\r",
                                .value.len = 9,
                                .value.actualLen = 9
                            };
                            cy_stc_ble_gatts_handle_value_ntf_t uart_tx_ntf = {
                                .handleValPair = uart_tx_handle,
                                .connHandle = app_conn_handle
                            };
                            
                            if(uart_notif_en)
                            {
                                Cy_BLE_GATTS_Notification(&uart_tx_ntf);
                            }
                            break;
                        }
                    }

                    break;
        		}
        case CY_BLE_EVT_GATTS_WRITE_REQ:
            {

                write_req_param = (cy_stc_ble_gatt_write_param_t*)eventParam;

                printf("[INFO] : GATT write characteristic with handle: 0x%x\r\n", 
                    write_req_param->handleValPair.attrHandle);
                printf("[INFO] : GATT write characteristic with len: 0x%04x\r\n", 
                    write_req_param->handleValPair.value.len);
                printf("[INFO] : GATT write characteristic with actual len: 0x%04x\r\n", 
                    write_req_param->handleValPair.value.actualLen);
                printf("[INFO] : GATT write characteristic with value: 0x%02x%02x\r\n", 
                    write_req_param->handleValPair.value.val[1], 
                    write_req_param->handleValPair.value.val[0]);

                if( CY_BLE_UART_TXD_CLIENT_CHARACTERISTIC_CONFIGURATION_DESC_HANDLE == 
                    write_req_param->handleValPair.attrHandle)
                {

                    printf("[INFO] : GATT write UART TX CCCD characteristic with value: 0x%x\r\n", 
                        write_req_param->handleValPair.value.val[0]);
                    uart_notif_en = (write_req_param->handleValPair.value.val[0] == 0x01);
                    Cy_BLE_GATTS_WriteRsp(app_conn_handle);
                }

                break;
            }
        default:
        {
            printf("[INFO] : Unknown BLE Event 0x%lX\r\n", (unsigned long) event);
        }
    }
}


/*******************************************************************************
* Function Name: ble_ias_callback
********************************************************************************
* Summary:
*  This is an event callback function to receive events from the BLE, which are
*  specific to Immediate Alert Service.
*
* Parameters:
*  uint32 event:      event from the BLE component
*  void* eventParams: parameters related to the event
*
*******************************************************************************/
void ble_ias_callback(uint32 event, void *eventParam)
{
    /* Alert Level Characteristic write event */
    if(event == CY_BLE_EVT_IASS_WRITE_CHAR_CMD)
    {
        /* Read the updated Alert Level value from the GATT database */
        Cy_BLE_IASS_GetCharacteristicValue(CY_BLE_IAS_ALERT_LEVEL,
                                           sizeof(alert_level), &alert_level);
    }

    /* Remove warning for unused parameter */
    (void)eventParam;
}


