cheyann3k/AutoBadger/PSoC6-Code/drivers/ble.c
/******************************************************************************
* Function Name: ble_start_advertisement
*******************************************************************************
* Summary:
*  This function starts the advertisement.
*
******************************************************************************/
static void ble_start_advertisement(void)
{
    cy_en_ble_api_result_t ble_api_result;

    if((CY_BLE_ADV_STATE_ADVERTISING != Cy_BLE_GetAdvertisementState()) &&
       (Cy_BLE_GetNumOfActiveConn() < CY_BLE_CONN_COUNT))
    {
        ble_api_result = Cy_BLE_GAPP_StartAdvertisement(
                            CY_BLE_ADVERTISING_FAST,
                            CY_BLE_PERIPHERAL_CONFIGURATION_0_INDEX);

        if(CY_BLE_SUCCESS != ble_api_result)
        {
            printf("[ERROR] : Failed to start advertisement \r\n");
        }
    }
}


/*******************************************************************************
* Function Name: wakeup_timer_interrupt_handler
********************************************************************************
* Summary:
*  wakeup_timer interrupt handler.
*
* Parameters:
*  void *handler_arg (unused)
*  cyhal_lptimer_irq_event_t event (unused)
*
*******************************************************************************/
void wakeup_timer_interrupt_handler(void *handler_arg, cyhal_lptimer_event_t event)
{
    /* Set the interrupt flag */
    wakeup_intr_flag = true;

    /* Reload the timer to get periodic interrupt */
    cyhal_lptimer_reload(&wakeup_timer);
    cyhal_lptimer_set_match(&wakeup_timer, WAKEUP_TIMER_MATCH_VALUE);
}


/*******************************************************************************
* Function Name: wakeup_timer_init
********************************************************************************
* Summary:
*  Initialize deep sleep wakeup timer for generating interrupt.
*
*******************************************************************************/
static void wakeup_timer_init(void)
{
    cyhal_lptimer_init(&wakeup_timer);
    cyhal_lptimer_set_match(&wakeup_timer, WAKEUP_TIMER_MATCH_VALUE);
    cyhal_lptimer_reload(&wakeup_timer);
    cyhal_lptimer_register_callback(&wakeup_timer, wakeup_timer_interrupt_handler, NULL);
    cyhal_lptimer_enable_event(&wakeup_timer, CYHAL_LPTIMER_COMPARE_MATCH,
                               WAKEUP_INTR_PRIORITY, true);
}


/*******************************************************************************
* Function Name: enter_low_power_mode
********************************************************************************
* Summary:
*  Configures the device to enter low power mode.
*
*  The function configures the device to enter deep sleep - whenever the
*  BLE is idle and the UART transmission/reception is not happening.
*
*  In case if BLE is  turned off, the function configures the device to
*  enter hibernate mode.
*
*******************************************************************************/
static void enter_low_power_mode(void)
{
    /* Enter hibernate mode if BLE is turned off  */
    if(CY_BLE_STATE_STOPPED == Cy_BLE_GetState())
    {
        printf("[INFO] : Entering hibernate mode\r\n");

        /* Turn of user LEDs */
        cyhal_gpio_write((cyhal_gpio_t)PIN_USER_LED, CYBSP_LED_STATE_OFF);
        //cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED2, CYBSP_LED_STATE_OFF);

        /* Wait until UART transfer complete  */
        while(1UL == cyhal_uart_is_tx_active(&cy_retarget_io_uart_obj));
        cyhal_syspm_hibernate(CYHAL_SYSPM_HIBERNATE_PINB_LOW);
    }
    else
    {
        cyhal_syspm_deepsleep();
    }
}


/* [] END OF FILE */
